{
  "locale": "fr",
  "translations": {
    "85900902563753880": "Contactez-moi",
    "5855714755249221993": "Tous droits reservés",
    "7164540129836416689": "Mentions légales",
    "718068350898796239": "Compétences",
    "2823327110111393272": "Projets",
    "7145912317041757511": "Moi",
    "1327410368924930457": "{$START_TAG_FA_ICON}{$CLOSE_TAG_FA_ICON}Compétences",
    "7099585307539013776": "{$START_TAG_FA_ICON}{$CLOSE_TAG_FA_ICON}Projets",
    "2810538019477699101": "{$START_TAG_FA_ICON}{$CLOSE_TAG_FA_ICON}Moi",
    "3053410130294131849": "Cette page est en cours de construction ou n'existe pas.",
    "5391088300270143650": "Revenir en lieu sûr",
    "888768522130578231": "À propos de moi",
    "2717082759043728718": "Je suis Enzo Filangi, (futur) ingénieur en développement logiciel.",
    "4282517467855569526": " Comme je suis sur le point de finir mes études, je cherche une porte d’entrée dans le monde professionnel. Une équipe où je pourrai atteindre mon plein potentiel, un mentor pour me guider durant ma carrière.{$LINE_BREAK}{$LINE_BREAK} Nous savons tous qu’une liste de compétences techniques n’est pas suffisante pour juger un candidat. S’il y a bien une leçon que mes amis devenus professionnels m’ont rapportée, c’est qu’une équipe préfère travailler avec quelqu’un de moins bon, mais plus sympa.{$LINE_BREAK}{$LINE_BREAK} Du coup, j’ai de la chance ! Je pense (totalement humblement) avoir des bases techniques solides, et en même temps être quelqu’un avec qui on a envie de discuter même en dehors des réunions strictement nécessaires.{$LINE_BREAK}{$LINE_BREAK} Alors j’ai fait cette page pour vous parler de ce que j’aime. En effet, c’est plus simple de s’intégrer à une équipe lorsque l’on partage des intérêts communs. J’espère donc qu’après avoir lu cette page, vous n’aurez plus besoin de choisir entre une personne compétente et une personne agréable. ",
    "8898751118331926824": "Côté loisirs",
    "2315634641404096888": "Jeux vidéo",
    "5883289544042860777": " Je suis un grand fan de jeux vidéo, depuis tout petit. Je suis né trop tard pour connaître le matériel rétro ; ma première console était une Nintendo DS. J’ai ensuite eu la DSi, la 3DS, une Xbox 360, et finalement une Switch quelques années plus tard. Mais je suis très rapidement passé au gaming sur PC - dès 2012 avec Minecraft 1.2.5 - et ma librairie Steam comporte aujourd’hui environ 150 jeux.{$LINE_BREAK}{$LINE_BREAK} Cependant, ce n’est pas ma seule expérience vidéo-ludique. En effet, je consomme beaucoup de contenu vidéo autour du jeux vidéo, du simple gameplay à l’analyse de jeux, genres ou mécaniques presque sous forme de documentaire. ",
    "651874017361598354": "Bibliothèque steam",
    "1782737287228126063": "Une capture d’écran de mes jeux steam les plus joués",
    "1625229659829019670": "Jeux de rôle",
    "8836763043024127763": " J’ai découvert l’univers des jeux de rôle papier au lycée, et j’y joue par intervalle depuis. Malheureusement, c’est un passe-temps qui s’effectue en sessions assez longues, et qui nécessite la présence de plusieurs personnes, il est donc plutôt compliqué de trouver un groupe régulier.{$LINE_BREAK}{$LINE_BREAK} J’ai pu occuper à la fois les rôles de joueur et de maître du jeu. Être libre de - et encouragé à - improviser et laisser libre court à sa créativité est pour moi l’un des attraits majeurs. Je trouve que cela permet de s’entraîner à parler en public sans préparation, ce qui est très utile dans la vie en général. ",
    "6822719341568514094": "Lancé de dés",
    "4355053218048459472": "Jeux de société",
    "3918808753750737234": " Je me suis vraiment mis aux jeux de société en école, grâce à la Taverne du Troll. Auparavant, à part les jeux de cartes ou les échecs, ils me paraissaient réservés aux enfants.{$LINE_BREAK}{$LINE_BREAK} En réalité, j’ai pu découvrir un monde complexe avec des jeux couvrant tout le spectre de la difficulté et de la complexité. Désormais, j’apprécie vraiment les moments où nous pouvons nous retrouver avec des amis. Que ce soit pour un jeu d’ambiance autour d’un verre, ou pour un jeu compétitif de plusieurs heures d’où nos cerveaux ressortent complètement vidés. ",
    "608102532254666604": "Une image du plateau du jeu 'terraforming Mars'",
    "4453763880431585558": "Terraforming Mars, un jeu sci-fi compétitif",
    "8049438184399680077": "Art et culture",
    "2075264934001124980": "Art numérique, peinture, arts plastiques",
    "3529303127992268484": " Je ne suis pas un très bon artiste, en revanche certains de mes amis ont un talent indéniable. Je me suis donc peu à peu ouvert à ces disciplines. Tout d’abord par le fan-art lié à la pop culture car cela me parlait le plus, puis petit à petit à des œuvres plus “traditionnelles” : dessin, peinture, sculpture. Mais aussi au cinéma ou même à l'architecture. Je suis loin d’être un amateur aguerri, cependant j’aime toujours découvrir de nouvelles œuvres et en apprendre un peu plus. ",
    "1478700475585808513": "Lecture",
    "8059670775518040476": " Enfant, je lisais beaucoup. J’ai eu la chance que mes parents aient veillé à ce que j’ai toujours des livres à disposition, et que ma tante - professeure - m’ait emmené chaque semaine à la bibliothèque.{$LINE_BREAK}{$LINE_BREAK} De fait, je suis un avide lecteur de fiction, même s’il m’est aujourd’hui difficile de trouver le temps de lire autant que je le souhaiterais. En revanche, les œuvres ancrées dans le réel (reportages, business, développement personnel, etc) m’attirent moins. ",
    "7977226261361864220": "La horde du contrevent",
    "3461105120244553250": "La chute des géants",
    "2494562918959667958": "La disparition de Stéphanie Mailer",
    "1758642903246080813": "The Witcher T1 : le dernier voeu",
    "4188685344343670448": "Certaines des oeuvres que j’ai le plus appréciées récemment",
    "4824678984874408118": "Science et technologie",
    "2708584190595590282": " C’est d’abord un goût pour la technologie qui m’a poussé à exercer ce métier. J’aime savoir comment fonctionnent les choses, et comment m’en servir pour construire d’autres choses. À vrai dire, je dois ce goût en partie aux jeux vidéo qui m’ont très tôt initié à l’univers de l’informatique.{$LINE_BREAK}{$LINE_BREAK} Aujourd’hui, je parcours beaucoup de sources différentes dans ma veille. Certaines spécialisées, regroupées en flux RSS sur Reeder, afin de rester au courant des développements importants en ingénierie logicielle, mais aussi en sécurité informatique ou pour internet au sens large. Mais également des sources plus grand public sur les réseaux sociaux, YouTube, etc concernant les sujets que j’apprécie comme le hardware mobile ou PC, les nouveaux gadgets innovants, ou encore des logiciels pratiques pour faciliter certaines tâches.{$LINE_BREAK}{$LINE_BREAK} Je consomme également une quantité assez importante de contenu de vulgarisation scientifique. Qu’il s’agisse de sciences dures, de sciences sociales (sociologie, économie, philosophie, etc), ou simplement de reportages indépendants ; j’aime découvrir tout un tas d’informations - de culture générale - à première vue sans réel lien les unes avec les autres, mais que je me retrouve à utiliser surprenamment souvent. ",
    "9093963013718874863": "Culture et visites",
    "8158939635611825999": " Enfin, j’aime visiter toutes sortes d’institutions culturelles. Musées, parcs zoologiques, jardins... Ce sont des lieux à la fois divertissants, et au sein desquels il est toujours possible d’apprendre de nouvelles choses, ou d’être impressionné par la beauté, l’étrangeté, ou la nouveauté de ce que l’on peut y voir. ",
    "5611274340596940663": "En extérieur",
    "3681011128402308176": "Sport",
    "8427982342079934091": " Je ne suis pas naturellement très sportif. Je trouve qu’il est difficile de se motiver régulièrement quand il est tellement plus simple de rester vissé dans sa chaise chez soi. Pourtant, je reconnais qu’une activité physique est nécessaire pour rester en bonne santé.{$LINE_BREAK}{$LINE_BREAK} Alors, je m’étais inscrit au club de Rugby de l’Efrei avant la pandémie. J’allais aussi régulièrement à la salle de sport. La routine me permettait de m’y mettre plus facilement en remplaçant la motivation par de la discipline.{$LINE_BREAK}{$LINE_BREAK} Pendant la pandémie, on m’a recommandé une application de training - Fitbod - qui m’a permis de rester actif chez moi avec le matériel que j’avais. J’ai conservé cette habitude aujourd’hui, et cela fait {$INTERPOLATION} semaines d’affilé que j’effectue au moins cinq séances de sport par semaine. L’avantage, c’est qu’elles n’ont pas besoin d’être toutes très longues car elles sont régulières et en quantité. ",
    "1469482104220719726": "Capture d'écran Fitbod",
    "6130786498939206016": "Voyages",
    "2921035383954548790": " Comme j’aime découvrir et visiter de nouveaux endroits, il m’arrive régulièrement de voyager. Tout d’abord en France, où la diversité de paysages et d’histoire est assez impressionnante. Cela s’inscrit dans ma volonté de connaître plus de lieux culturels. En effet, bien que mon origine francilienne facilite l’accès à la culture vu tous les musées ou monuments présents dans la capitale, il existe tout autant de choses à voir ailleurs, qu’on ne peut vraiment apprécier qu’en se rendant sur place.{$LINE_BREAK}{$LINE_BREAK} Toutefois j’ai également eu la chance de voyager à l’étranger. Ainsi j’ai pu visiter des villes anglo-saxonnes comme Londres ou New-York, mais également l’Ouest américain au courant d’un long road-trip de plusieurs semaines. J’ai aussi visité la Belgique, la Suisse et l’Espagne. Et, enfin, j’ai vécu six mois en Italie pendant mon stage. Je sais que ça sonne cliché, mais la différence de culture est vraiment palpable. Même pour deux pays si proches et dont l’histoire est si liée, la façon d’aborder les choses varie énormément. ",
    "5729800980887882443": " Expériences{$LINE_BREAK}{$START_TAG_SPAN}Associatives{$CLOSE_TAG_SPAN}",
    "6645821636651715026": "Trésorier {$LINE_BREAK}Vice-président",
    "2689563907298093033": "Mars 2020 - Mars 2021",
    "5875290368501393145": " FAP Efrei - Association de formation en informatique aux séniors, enfants, personnes en situation de handicap, et personnes en réinsertion professionnelle.{$LINE_BREAK}{$LINE_BREAK} Gérer les fonds de l'association et son financement.{$LINE_BREAK}{$LINE_BREAK} Plannifier le futur de l’association. Gestion quotidienne. ",
    "4688600232093854513": "Formateur",
    "9126297347603886337": "Octobre 2018 - Mars 2019",
    "1316721171904411716": " FAP Efrei{$LINE_BREAK}{$LINE_BREAK} Dispenser des cours d’informatique aux séniors de la ville. ",
    "4392825668891812319": "Responsable {$LINE_BREAK}des évènements",
    "2618488872591983496": "Mars 2019 - Mars 2020",
    "7317237141089019497": " FAP Efrei{$LINE_BREAK}{$LINE_BREAK} Organiser des evènements au sein de l’école ou lors de salons pour recruter des bénévoles et faire connaître l’association. ",
    "1933939761477338518": "Responsable {$LINE_BREAK}Technique",
    "202734985229161863": "Mars 2021 - Mars 2023",
    "6218103010677180859": " Asian’Efrei - Association de culture asiatique.{$LINE_BREAK}{$LINE_BREAK} Développer le site internet de l’association.{$LINE_BREAK}{$LINE_BREAK} Gérer l'infrastructure technique d’Asian’Efrei. ",
    "748029266949917624": "Membre",
    "2426901324819533615": "Septembre 2019 - Septembre 2023",
    "1601210950523108490": " Taverne du Troll - Association de jeux sur table et de jeux de société.{$LINE_BREAK}{$LINE_BREAK} Participation à l’oganisation des divers évènements et tournois. ",
    "8290405178660187060": "Mes projets principaux",
    "1368671341251181255": "ULL est une plateforme visant à ubériser le monde de l’évènementiel. Réalisé comme projet de fin d’année de M1, ULL permet à des particuliers de rechercher et réserver facilement des prestations pour des évènements de toute taille (anniversaire, mariage...). Notre équipe aux compétences pointues dans de nombreux domaines adjascents était parfaitement adaptée pour répondre aux défis de ce projet ambitieux.",
    "7660215322618782428": "Sélectionné comme meilleur projet de notre filière, Medchain a été réalisé en un mois durant un bootcamp de notre école dédié à la gestion de projet. Le but de Medchain est d’offrir un écosystème aux médecins, pharmaciens et patients permettant de dématérialiser les ordonnances tout en assurant la sécurité et la confidentialité des données et en éliminant tout abus d’ordonnance possible.",
    "8517790327113290481": "Le site d’Asian’Efrei avait bien besoin d’un coup de jeune. Originellement un mix de plug-in Wordpress à peine fonctionnel, le site est désormais moderne et stable. Avec l’équipe d’Asian’Efrei, nous avons établi l’ensemble des fonctionnalités désirées pour le site, et nous sommes mis d’accord sur le design des éléments. Le site inclut désormais davantage d’informations, du Server Side Rending pour optimiser le SEO, ainsi qu’un système complet de CMS pour ajouter facilement des articles ou albums.",
    "6968151917960155162": "Virtue est un réseau social visant à encourager les comportements positifs, bénéfiques et civils. L’idée est de permettre aux utilisateurs de commenter sur le profil des autres les bonnes actions qu’ils les ont vu réaliser et de laisser un certain nombre d’étoiles dans cet avis. Le site utilise alors différents paramètres pour estimer l’impact positif des membres à partir des avis des personnes qu’ils ont côtoyées.",
    "7600777454788279187": "Email copié !",
    "3920134220602117612": "https://enzofilangi.fr/static/Enzo_Filangi_CV_FR.pdf",
    "6394576224493336322": "Hé ! Vous !",
    "5368515350926984565": " J’adore programmer, découvrir de nouvelles choses et lieux, et réaliser des trucs épatants.{$LINE_BREAK} Je recherche un stage d’avril à octobre 2023 dans la métropole de Montpellier.{$LINE_BREAK} N’hésitez pas à regarder ce que j’ai fait par le passé, et à me contacter si mon profil vous intéresse ! ",
    "1130601308681551827": " Expérience{$LINE_BREAK}{$START_TAG_SPAN}Professionnelle{$CLOSE_TAG_SPAN}",
    "6734542431798973825": "Développeur logiciel",
    "7448631190503624449": "Novembre 2021 - Avril 2022",
    "4189263152493151913": "Seriate, Lombadie, Italie",
    "2040557411586058554": "Entreprise italienne spécialisée dans la conception et manufacture de matériel de radiologie.",
    "814639199729848856": "Élaboration d’éléments d’interface complexes en réalité augmentée. Vision par ordinateur.",
    "8532985173059314601": "Assistant commercial",
    "4637479411324961341": "Janvier 2020",
    "2428815892296805244": "Rungis, France (94)",
    "8051747483638788053": "Vente de matériel de radiologie sur l’entièreté du marché français.",
    "1792616214190277728": "Utilisation de techiques commerciales avancées. Relation client long terme. {$LINE_BREAK}Négocier et préparer une affaire.",
    "8452397932805691712": "Job étudiant",
    "6230904666309691392": "Juillet 2019",
    "4578490043841540882": "Annecy, France (74)",
    "750818341346132014": "Interagir avec la clientèle dans le but de réaliser une vente. Gérer un stand, une caisse et du stock. Résoudre des litiges client.",
    "3681183018620780427": "Expliquer les consignes avec pédagogie. Langues étrangères.",
    "951181368429953411": "Stage ouvrier de 1{$START_SUPERSCRIPT}ère{$CLOSE_SUPERSCRIPT} année",
    "8360571242499109541": "Juin 2019",
    "572093045463234055": "Fresnes, France (94)",
    "2890420044355883298": "Respecter des consignes comportementales strictes sur le lieu de travail.{$LINE_BREAK}Introduction au monde du travail.{$LINE_BREAK}S’adapter au fonctionnement d’un service.",
    "1338480611696165967": "Formation",
    "4733648719027720405": " École d'ingénieur généraliste en informatique et technologies du numérique{$LINE_BREAK} Major de promotion 1{$START_SUPERSCRIPT}ère{$CLOSE_SUPERSCRIPT}, 2{$START_SUPERSCRIPT}ème{$CLOSE_SUPERSCRIPT} et 3{$START_SUPERSCRIPT}ème{$CLOSE_SUPERSCRIPT} années ",
    "287563681379591468": "Lycée Saint-Charles {$LINE_BREAK}Baccalauréat Scientifique",
    "1597584568850201044": " Spécialité ISN option SVT{$LINE_BREAK} Mention Très Bien (18,12/20) ",
    "6830247888450820062": "Créateur, éditeur et propriétaire du site",
    "6333998216596873020": " Directeur de la publication : Enzo Filangi{$LINE_BREAK} E-mail : {$START_LINK}enzo.filangi@efrei.net{$CLOSE_LINK}",
    "2545706311007543622": "Hébergeur",
    "4437645849555367609": "{$START_BOLD_TEXT}OVH{$CLOSE_BOLD_TEXT}{$LINE_BREAK} RCS Lille Métropole 424 761 419 00045{$LINE_BREAK} Code APE 2620Z{$LINE_BREAK} N° TVA : FR 22 424 761 419{$LINE_BREAK} Siège social : 2 rue Kellermann - 59100 Roubaix - France{$LINE_BREAK}",
    "5491665272873323758": "Politique de confidentialité",
    "6929384258276029544": " Ce site n'utilise aucun cookie ni autre mécanisme à des fins de suivi.{$LINE_BREAK} Votre adresse IP et des informations techniques envoyées par votre navigateur sont susceptibles d’être enregistrées à des fins techniques uniquement lors du chargement du site. Ces données n’ont pas vocation à être utilisées à des fins commerciales ou de suivi. Elles sont nécessaires au bon fonctionnement du site.{$LINE_BREAK} Pour toute question relative à l’utilisation de vos données, veuillez me contacter à l’adresse suivante : enzo.filangi@efrei.net{$LINE_BREAK}",
    "3868231683882087985": "Crédit photo et icônes",
    "6112481001884355750": " Tous les logos ou images d’entreprises ou d’organisations exposés sur ce site appartiennent à leur propriétaire d'origine et ne sont utilisés qu'à des fins de citation.{$LINE_BREAK}{$LINE_BREAK} Icônes par : ",
    "1575795395192044829": "{$START_LIST_ITEM}Fonticons, Inc. - site : {$START_LINK}fontawesome.com{$CLOSE_LINK}{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Freepik - site : {$START_LINK_1}www.flaticon.com{$CLOSE_LINK}{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Favicon par flatart_icons - site : {$START_LINK_2}Flaticon{$CLOSE_LINK}{$CLOSE_LIST_ITEM}",
    "3267228329216978505": " Crédit photos d'illustration : ",
    "137403688500631522": "{$START_LIST_ITEM}Pixabay{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}General Medical Merate{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Castorama{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Fap Efrei{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Asian'Efrei{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Taverne du Troll{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}La volte{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Le livre de poche{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}De Fallois{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Bragelonne{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Fitbod{$CLOSE_LIST_ITEM}",
    "3235693443782854085": "Mes compétences",
    "108453552402373144": " Au cours de mes projets, stages, et expériences diverses j’ai pu acquérir un ensemble de compétences variées.{$LINE_BREAK} Voici donc une liste des langages, technologies et autre que je sais manier; organisée selon mon niveau de maîtrise pour chacun d’eux. ",
    "6933210216625290545": "Langages, frameworks et librairies",
    "2081990174363016768": "Je maîtrise",
    "4491947248479706456": " Le développement web étant mon domaine de compétence principal, je maîtrise bien les langages et frameworks qui y sont employés. J’ai pu réaliser de nombreux projets en utilisant ces technologies, aussi bien côté frontend que backend. ",
    "2307692863006818370": " Le langage SQL étant le standard de la manipulation de données, il était indispensable pour moi de le maîtriser. J’ai également eu l’occasion de réaliser des bases de données plus intelligente en utilisant le PL/SQL pour mieux automatiser la gestion de la base de données. ",
    "6259411508532590574": " Je place Java à part car j'ai pu l'utiliser pour réaliser de nombreuses applications durant mes études. C’est un des langages orienté objet que je manipule le mieux. ",
    "7661893704593052436": " Enfin, j’ai beaucoup d’expérience avec le C++ et QT grâce au stage que j’ai effectué en Italie au sein de General Medical Merate. Je place la librairie OpenCV dans cette catégorie car c’est en C++ que je l’ai utilisée. ",
    "4169477360966665802": "J'ai de l'expérience",
    "1539426632055473727": " J’ai pu me constituer une certaine expérience avec les langages et librairies de cette section au travers de mes études et de petits projets. Je n’ai toutefois pas encore eu l’occasion de les utiliser dans des projets de plus grande envergure. ",
    "1047957967836750638": "Utilisant un OS basé sur UNIX au quotidien, et WSL couramment sous Windows, j’ai souvent l’occasion de manipuler la ligne de commande et notamment les terminaux Bash et Zsh. J’ai pu réaliser de nombreux scripts pour faciliter certaines tâches.",
    "2596904034707720020": "Mon cursus d’ingénieur a laissé la part belle aux mathématiques et à la physique, notamment durant les années de classe préparatoire. De fait, je me suis souvent servi de LaTeX pour rédiger mes rapports.",
    "7840666555593512701": "J’utilise Markdown au quotidien pour la prise de note sur ordinateur. Je trouve ce système de formatage simple et intuitif.",
    "2199031267872815517": "La réalisation de diagrammes UML est une étape importante de la conception de mes projets, et j’utilise souvent cette représentation graphique pour modéliser clairement des systèmes complexes.",
    "2904111679978917476": "Je les ai utilisés",
    "4127585170582842429": " J’ai déjà manipulé ces langages par le passé. Bien que je serais capable de rapidement me former, je ne les considère pas comme des langages où je suis très expérimenté. ",
    "2861175318593109227": "Technologies et logiciels",
    "8594859322691246637": " Je me sers des trois principaux systèmes d'exploitation régulièrement. Au quotidien, j'utilise une machine macOS. Pour jouer, un PC Windows. Et pour faire fonctionner mon serveur, une distribution Linux. Ainsi, je suis capable de passer rapidement et facilement de l'un à l'autre, et suis à l'aise à la fois dans un environnement graphique ou en ligne de commande. ",
    "922031741543182237": " Pour mes projets nécessitant du stockage structuré à long terme, j'ai pu utiliser aussi bien MySQL que PostgreSQL. Ainsi, je peux m'adapter à différentes technologies de SGBDR. J'ai également expérimenté avec des bases de données NoSQL, mais ne m'en suis pas encore servir dans un projet conséquent. ",
    "993648591981255942": " À titre personnel, j'utilise les IDE de la suite Jetbrains (IntelliJ, Webstorm, etc) pour la grande majorité de mes projets, car je préfère un logiciel tout-en-un. Visual Studio Code a toutefois une place importante dans ma façon de travailler, lorsque je planche sur des tâches plus \"légères\" telles qu'un script Bash, l'édition de fichiers JSON/YML, et ainsi de suite. Je sais également me servir d'IDE plus spécifiques en fonction des stacks tels que QT Creator. ",
    "3919140703022612923": " J'utilise git sur tous mes projets, c'est un outil indispensable à mon sens. Je me sers également de GitHub pour héberger mon code sur tous ces projets. ",
    "1787542791514250305": "J'ai pu manipuler Node.js sur de nombreux projets, qu'il s'agisse de réaliser des applications backend ou juste faire tourner des scripts JavaScript.",
    "3464044438652368543": "J'ai découvert Figma en cherchant comment réaliser les maquettes de mes différents projets, et je m'en sers depuis dès que j'ai besoin de créer un design. N'étant pas UI/UX designer de formation, je ne peux qu'apprécier la simplicité et la versatilité de cet outil.",
    "2260470174971670215": "Que ce soit pour rédiger des rapports de projets, des tableaux complexes ou préparer des présentations, je me sers de la suite Office depuis des années. J'utilise également les outils équivalents de Google Workspace dont je trouve les fonctionnalités de collaboration plus poussées. Mention également à Obsidian que j'utilise pour prendre des notes en Markdown, et Notability dont je me sers pour écrire sur iPad.",
    "2311090641268100665": " Cherchant à expérimenter avec le processus DevOps, j'ai pu apprendre ces technologies afin d'aisément conteneuriser et déployer des applications. Ce site, notamment, est déployé grâce à Docker et Docker compose. ",
    "8903596240255941193": "J'ai pu expérimenter avec Electron lors du projet Medchain. Cette technologie nous a permis très facilement de transposer notre savoir-faire dans le navigateur à une application de bureau.",
    "442538936759650094": "Nginx m'a été très utile pour configurer facilement les serveurs de différents projets. Bien que je ne sois pas un expert réseau, j'ai tout de même pu déployer des applications sans trop de difficultés.",
    "983117016268135692": "Je me suis servi d'Oracle Database dans mes études, notamment lors de cours de gestion de base de données avec l'utilisation de PL/SQL. Bien qu'il s'agisse d'un logiciel complexe, j'ai pu en saisir la pertinence sur des systèmes à l'échelle d'entreprises.",
    "3481075551914040653": "Durant un projet de Cloud, nous avons utilisé Firebase et Firestore afin de découvrir l'utilisation d'un stack FaaS.",
    "8910717689845381189": "J'ai pu utiliser ActiveMQ sur un projet académique afin de synchroniser et faire communiquer plusieurs applications.",
    "399792011054013135": "DaVinci Resolve est un logiciel de montage vidéo. Je m'en suis servi pour réaliser plusieurs vidéos, à la fois pour présenter des projets mais également pour mener des interviews.",
    "6751441754948847748": "Autre",
    "8902029436332253262": "Langues",
    "22479728914721775": "Français{$LINE_BREAK}{$LINE_BREAK}Langue maternelle",
    "8247313663250870270": "Anglais{$LINE_BREAK}{$LINE_BREAK}TOEIC : 990/990{$LINE_BREAK}{$START_LINK}Certificat{$CLOSE_LINK}",
    "824605795902365380": "Espagnol{$LINE_BREAK}{$LINE_BREAK}A2",
    "880815556585061475": "Italien{$LINE_BREAK}{$LINE_BREAK}A1",
    "6949278321711573887": " Que ce soit durant mes études, mes loisirs, ou grâce à des voyages, j’ai pu apprendre plusieurs langues en plus du français. L’anglais est de loin la langue étrangère que je parle le mieux, mais j’ai également des notions d’espagnol et d’italien. ",
    "3014984376950430597": "Certifications",
    "15999953683452512": "Permis B"
  }
}