{
  "locale": "en",
  "translations": {
    "85900902563753880": "Contact me",
    "5855714755249221993": "All rights reserved",
    "7164540129836416689": "Legal",
    "718068350898796239": "Skills",
    "2823327110111393272": "Projects",
    "7145912317041757511": "Me",
    "1327410368924930457": "{$START_TAG_FA_ICON}{$CLOSE_TAG_FA_ICON}Skills",
    "7099585307539013776": "{$START_TAG_FA_ICON}{$CLOSE_TAG_FA_ICON}Projects",
    "2810538019477699101": "{$START_TAG_FA_ICON}{$CLOSE_TAG_FA_ICON}Me",
    "3053410130294131849": "This page is under construction or doesn't exist.",
    "5391088300270143650": "Go back",
    "888768522130578231": "About me",
    "2717082759043728718": "I'm Enzo Filangi, a (future) software engineer.",
    "3462167780156779481": " As I'm about to finish my studies, I’m looking for a gateway to the professional world. A team where I could achieve my full potential, a mentor to guide me during my career.{$LINE_BREAK}{$LINE_BREAK} As we all know, a list of technical skills isn’t enough to make a decision about a candidate. If there is one lesson my friends turned professionals told me, it’s that a team would rather prioritize good character over raw skill.{$LINE_BREAK}{$LINE_BREAK} Lucky for me! I think (very humbly) that I have a solid technical foundation, while being someone you’d want to talk with outside of strictly necessary meetings.{$LINE_BREAK}{$LINE_BREAK} So I wrote this page to tell you about what I like. Indeed, it’s easier to join a team when you share common interests. Therefore I hope that, after reading this, you won’t need to choose between someone competent and someone nice anymore.",
    "8898751118331926824": "My hobbies",
    "2315634641404096888": "Video games",
    "5883289544042860777": " I’ve been a big video games fan since I was a child. I was born too late to have retro stuff though; my first console was a Nintendo DS. I then had a DSi, a 3DS, an Xbox 360, and finally a Switch some years later. However I quickly switched sides to PC gaming – as soon as 2012 with Minecraft 1.2.5 – and my steam library kept growing ever since.{$LINE_BREAK}{$LINE_BREAK} Playing isn’t my only gaming experience though. I consume a lot of content about video games, from simple gameplay to video essays analyzing games, genres, or mechanics.",
    "651874017361598354": "Steam library",
    "1782737287228126063": "A screenshot of some of my most played steam games",
    "1625229659829019670": "Tabletop roleplaying games",
    "8836763043024127763": " I discovered tabletop RPGs in high school and have been playing on and off ever since. Sadly, as it’s played in long sessions that need many people to be present, it’s quite hard to have a regular group and schedule.{$LINE_BREAK}{$LINE_BREAK} Over the years I took both the roles of player and game master. Being free – and encouraged – to improvise and give free rein to our creativity is for me the main appeal. I believe that it allows us to train our unprepared public speaking skills, which is very useful in life in general.",
    "6822719341568514094": "Dice throw",
    "4355053218048459472": "Board games",
    "3918808753750737234": " I truly started playing board games in college thanks to the Taverne du Troll. Before, I thought that – expect for like card games or chess – board games were for children.{$LINE_BREAK}{$LINE_BREAK} In reality, I discovered a complex world with games spanning all the difficulty and complexity spectrum. Nowadays, I really enjoy gathering moments with my friends. Be it to play some party games around a drink, or a very competitive, hours-long game from which we emerge mentally exhausted.",
    "608102532254666604": "The board of 'terraforming Mars', a board game",
    "4453763880431585558": "Terraforming Mars, a competitive sci-fi game",
    "8049438184399680077": "Art and culture",
    "2075264934001124980": "Digital art, paintings, fine arts",
    "3529303127992268484": " I’m not a very good artist. However, some of my friends are. So I tried to open up to this field; first with pop culture fan-art as that was the most appealing to me, and then with more “traditional” works: drawing, painting, sculpture… But also cinema or architecture. I’m far from being a seasoned amateur, though I like to discover new works and to learn a bit more every time. ",
    "1478700475585808513": "Reading",
    "8059670775518040476": " As a child, I read a lot. I was lucky to have parents that took care to always provide me with books to read, and that my aunt – working as a teacher – brough me to the library every week. Thus, I’m now an avid reader, though it’s hard to find as much time to read as I would like. I prefer works of fiction, as I don’t find books about business, personal development, or even investigations to be that interesting. ",
    "7977226261361864220": "La horde du contrevent",
    "3461105120244553250": "Fall of Giants",
    "2494562918959667958": "La disparition de Stéphanie Mailer",
    "1758642903246080813": "The Witcher T1 : The last wish",
    "4188685344343670448": "Some of the works I liked best",
    "4824678984874408118": "Science and technology",
    "2708584190595590282": " It’s above all a love for technology that pushed me to pursue this line of work. I like to know how things work, and how to use them to build other things. Truth be told, I owe part of this love to video games which have very early introduced me to the world of computers.{$LINE_BREAK}{$LINE_BREAK} Today, I follow a lot of different sources to stay informed. Some are specialized, grouped in an RSS feed on Reeder, so I can stay aware of current developments in computer science, cybersecurity, and the internet as a whole. Some are more casual, on social networks, YouTube and so on, about topics I enjoy like mobile or PC hardware, new innovative gadgets, or even useful software to make some tasks easier.{$LINE_BREAK}{$LINE_BREAK} I also consume a relatively important quantity of science-related video content. From hard science to social science (sociology, economy, philosophy, etc), or even independent reporting about engineering stories for instance. I love to discover all these pieces of seemingly unrelated information – of general knowledge – that I find myself using surprisingly often. ",
    "9093963013718874863": "Culture and visits",
    "8158939635611825999": " Finally, I like to visit all sorts of cultural institutions. Museums, zoos, gardens… These places are both entertaining, and a place to learn new knowledge, or where one can be impressed by the beauty, the strangeness, or the novelty of the things that can be seen there. ",
    "5611274340596940663": "Outside",
    "3681011128402308176": "Sport",
    "8427982342079934091": " I’m not a natural athlete. I find it hard to motivate myself regularly when it’s so much easier to just stay at home. That being said, I recognize the importance of physical activity for our health.{$LINE_BREAK}{$LINE_BREAK} So, I signed up to Efrei’s rugby team before the pandemic. I trained every Monday, and often went to the gym as well. The routine allowed me to trade motivation for discipline, which is easier to manage.{$LINE_BREAK}{$LINE_BREAK} During the pandemic, I got recommended a fitness app called Fitbod, which allowed me to stay active at home with the equipment I had. I kept the habit, and I’ve been training at least 5 days a week for the past {$INTERPOLATION} straight weeks. The big upside is that they don’t all need to be hard or long, as they’re regular and plentiful.",
    "1469482104220719726": "Fitbod app screenshot",
    "6130786498939206016": "Travels",
    "2921035383954548790": " As I like to discover and visit new places, I regularly travel. First of all in France, where the diversity of landscape and history is quite impressive. This is in line with me wanting to learn about more cultural places. Indeed, while my Parisian origin makes it easier to access culture considering all the museums and monuments in the capital, there are so many other things to see elsewhere, that can only be appreciated by going there.{$LINE_BREAK}{$LINE_BREAK} However, I also had the luck to visit foreign cities like London or New-York, as well as the American west during a weeks-long road trip. I also visited Belgium, Switzerland, and Spain. And finally, I lived for six months in Italy during my internship. I know it sounds cliché, but the cultural difference is so palpable. Even for two countries that are this close and with such a linked history, the way people do things is vary enormously. ",
    "5729800980887882443": "{$START_TAG_SPAN}Student club{$CLOSE_TAG_SPAN}{$LINE_BREAK}Experiences",
    "4688600232093854513": "Tutor",
    "9126297347603886337": "October 2018 - March 2019",
    "7648393445893141085": "FAP Efrei<br><br> Taught senior citizens how to use computers, mobile phones, and so on.",
    "6123654188328685299": "Head of events",
    "2618488872591983496": "March 2019 - March 2020",
    "5727702279543572459": "FAP Efrei<br><br>Organized events both in and out of the school to recruit new members and give the club a greater reach.",
    "5194714455191671241": "Treasurer <br>Vice-president",
    "2689563907298093033": "March 2020 - March 2021",
    "163227738871465379": "FAP Efrei - Student club devoted to giving computer training to seniors, children, people with disabilities, and people in professional reintegration.<br><br> Managed the association’s funds and financing.<br><br> Planned for the future and day-to-day management.",
    "748029266949917624": "Member",
    "2426901324819533615": "September 2019 - September 2023",
    "1658257914795647304": "Taverne du Troll<br><br>Helped organize several events and tournaments.<br><br>Animated weekly game sessions.",
    "5842175522603390209": "Secretary",
    "5394621701612590768": "October 2022 - March 2023",
    "6518156972535507451": "Taverne du Troll - Tabletop and board games club.<br><br>Realized and validated various administrative tasks for the association<br><br>Planned, organized, and managed numerous events gathering tens of people.",
    "7102252234497519203": "Technical <br>Director",
    "202734985229161863": "March 2021 - March 2023",
    "7479757653253423182": "Asian’Efrei - Asian culture club.<br><br>Developed a new website for the club.<br><br>Managed Asian’Efrei’s technical infrastructure.",
    "8290405178660187060": "My main projects",
    "1368671341251181255": "ULL is a platform whose goal is to uberize the world of events. Developed as an end-of-year project in Master 1, ULL allows private individuals to easily search and book performances for events of all sizes (anniversaries, weddings and so on). Our team consisted of skilled people with many adjacent areas of expertise, perfectly adapted to take on the challenges of this ambitious project.",
    "7660215322618782428": "Chosen as the best project of our major, Medchain was developed during a bootcamp organized by our school to focus on project management. The objective of Medchain is to offer an ecosystem to doctors, pharmacists and patients to dematerialize prescriptions while preserving all the security and confidentiality they expect, and eliminating as many opportunities to abuse prescriptions as possible.",
    "8517790327113290481": "Asian’Efrei’s website needed a fresh start. Originally a barely functioning mix of WordPress plug-ins, the website is now modern and stable. With the team of Asian’Efrei, we sat down to list all the features and design element they wanted. The site now includes more information about the club, Server-Side Rendering to optimize SEO, and a complete CMS system to easily add articles or albums.",
    "6968151917960155162": "Virtue is a social network aiming at encouraging positive, civic, and beneficial behavior. The idea is to allow users to comment on each other’s profiles to relay the good deeds they saw them do and leave a certain number of stars in that comment. The site then uses several sources of information to estimate the positive impact of its members.",
    "7600777454788279187": "Email copied !",
    "3920134220602117612": "https://enzofilangi.fr/static/Enzo_Filangi_CV_EN.pdf",
    "6394576224493336322": "Hey! You!",
    "7118122345515635965": " I love to program, discover new things and places, and build amazing stuff.{$LINE_BREAK} Don't hesitate to look at what I've done, and to contact me if you find my profile interesting! ",
    "1130601308681551827": " {$START_TAG_SPAN}Professional{$CLOSE_TAG_SPAN}{$LINE_BREAK}Experience",
    "4192208135160262102": "Capgemini FS France",
    "3260016578597095189": "Full Stack Developer",
    "1341013561311600534": "April 2023 - September 2023",
    "242736383141402210": "Montpellier, France (34)",
    "9133506197813796301": "Full stack development of a hierarchy visualization application.|Frontend Angular, Angular Material, and Tailwind CSS. Backend Spring Boot and MySQL.|Conducted research on the use of generative AI during development.",
    "2668420910627414103": "General Medical Merate",
    "1576844436516800602": "C++ Developer",
    "7448631190503624449": "November 2021 - April 2022",
    "4189263152493151913": "Seriate, Lombadia, Italy",
    "6367542821309502070": "Italian company specialized in the design and manufacturing of radiology equipment.|Created complex augmented-reality interface elements for radiology equipment. Computer vision.",
    "1920157952247360834": "Primax",
    "8532985173059314601": "Commercial assistant",
    "4637479411324961341": "January 2020",
    "2428815892296805244": "Rungis, France (94)",
    "3037638515883174568": "Radiology equipment sales on the whole French market.|Complex sales techniques. Long term customer relations. Negotiating and preparing a sale.",
    "2126731809498832475": "Minigolf de l'impérial",
    "8452397932805691712": "Student job",
    "6230904666309691392": "July 2019",
    "4578490043841540882": "Annecy, France (74)",
    "5162064440517495957": "Interacted with potential customers to make a sale. Ran a stand. Managed stock and checkout. Resolved client complaints.|Taught customers how to use the equipment. Trained foreign languages.",
    "1338480611696165967": "Studies",
    "4733648719027720405": " Valedictorian 1{$START_SUPERSCRIPT}st{$CLOSE_SUPERSCRIPT}, 2{$START_SUPERSCRIPT}nd{$CLOSE_SUPERSCRIPT} and 3{$START_SUPERSCRIPT}rd{$CLOSE_SUPERSCRIPT} years ",
    "287563681379591468": "Saint-Charles High School {$LINE_BREAK}Scientific Baccalaureate",
    "1597584568850201044": " Computer science specialization, biology elective.{$LINE_BREAK} Graduated with honors (18,12/20) ",
    "6830247888450820062": "Creator, editor and owner of the website",
    "6333998216596873020": " Director of publication : Enzo Filangi{$LINE_BREAK} E-mail : {$START_LINK}enzo.filangi@efrei.net{$CLOSE_LINK}",
    "2545706311007543622": "Host",
    "4437645849555367609": "{$START_BOLD_TEXT}OVH{$CLOSE_BOLD_TEXT}{$LINE_BREAK} RCS Lille Métropole 424 761 419 00045{$LINE_BREAK} Code APE 2620Z{$LINE_BREAK} N° TVA : FR 22 424 761 419{$LINE_BREAK} Siège social : 2 rue Kellermann - 59100 Roubaix - France{$LINE_BREAK}",
    "5491665272873323758": "Confidentiality policy",
    "6929384258276029544": " This website doesn’t use any cookie nor any other means of tracking.{$LINE_BREAK} Your IP address and other technical information sent by your browser might be logged for technical purposes when a page is requested. This information isn’t meant to be used for commercial or tracking purposes. It is necessary for the website to function properly.{$LINE_BREAK} For any question relative to your data, please contact me at the following address: enzo.filangi@efrei.net{$LINE_BREAK}",
    "3868231683882087985": "Pictures and icons credits",
    "6112481001884355750": " All the logos and images of companies or organizations displayed on this website belong to their original owner and are only used for citation purposes.{$LINE_BREAK}{$LINE_BREAK} Icons by:",
    "1575795395192044829": "{$START_LIST_ITEM}Fonticons, Inc. from {$START_LINK}fontawesome.com{$CLOSE_LINK}{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Freepik from {$START_LINK_1}www.flaticon.com{$CLOSE_LINK}{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Favicon by flatart_icons from : {$START_LINK_2}Flaticon{$CLOSE_LINK}{$CLOSE_LIST_ITEM}",
    "3267228329216978505": "Illustration picture credits: ",
    "5262225705228414776": "{$START_LIST_ITEM}Pixabay{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Capgemini{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}General Medical Merate{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Fap Efrei{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Asian'Efrei{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Taverne du Troll{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}La volte{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Le livre de poche{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}De Fallois{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Bragelonne{$CLOSE_LIST_ITEM}{$START_LIST_ITEM}Fitbod{$CLOSE_LIST_ITEM}",
    "8255616965921889726": "Gallery",
    "2781907390220558666": "My projects",
    "6488588885329353329": "During my studies I realized several projects. Some to get my diploma, but also other for my hobbies or to gain more experience.{$LINE_BREAK} Here’s a list of some of my projects. Some entries have a gallery associated with them, to help you get a better idea of what they do and look like.",
    "7345591768678246455": "Green Rock Investment Simulator",
    "6421835032682903840": "This serious game destined for business school students covers the main mecanisms behind financial markets to allow them to learn how they work without risk.",
    "6400775125511757980": "Portfolio Website",
    "762930287789711339": "Looking to get a stronger online presence than a simple LinkedIn profile, I crafted this website to have a central repository of all my experiences.",
    "4675822376069551524": "DnD Initiative Tracker",
    "7182299588509274119": "Being a game master in a Dungeons and Dragons group with friends, I wanted to make my life easier when dealing with the order of play during fights.<br> So I developed this app to automatically handle the progression of the game.",
    "6193689242329562491": "ULL",
    "4788637585232922794": "ULL is a platform looking to uberize personal events. It allows individuals to easily look for and book services for events of all sizes (birthdays, weddings…).",
    "6142250199221864460": "Initiation to Firebase",
    "1293920334897827371": "This small project during a Cloud Computing class is a modest clone of the Medium blogging platform. It allowed me to learn about FaaS and train how to use this approach of the cloud.",
    "1057888548390723077": "Asianefrei.org",
    "3469651829934761454": "Asian’Efrei was looking for a revamp of their website. As a member of this student club looking to get more experience, I accepted to help them reach their goal.",
    "2656669682396724397": "Medchain",
    "8618348565290697186": "The goal of Medchain is to offer an ecosystem to doctors, pharmacists and patients that would allow them to digitalize medical prescriptions while ensuring security and confidentiality, and preventing any possible source of prescription abuse.",
    "3244968553758336963": "Virtue",
    "1948780694236197441": "Virtue is a social network aiming to encourage positive, polite, and socially beneficial behavior. The idea is to allow users to write on each other’s profile about the good deeds they saw them do.",
    "3235693443782854085": "My skills",
    "108453552402373144": " During my various projects, internships and experiences I have acquired a diverse set of skills.{$LINE_BREAK} So, here is a list of all the languages, technologies and other things I know; organized according to my level of proficiency for each category.",
    "6933210216625290545": "Languages, frameworks and librairies",
    "2081990174363016768": "I am proficient",
    "4491947248479706456": " Web development being my main area of expertise, I have a good understanding of the languages and frameworks used in the field. I have done many projects with these technologies, both on the frontend and backend.",
    "3137517225484407181": "I was also able to use Java and Spring Boot to develop reliable and scalable applications in a variety of contexts.",
    "2307692863006818370": " SQL is a standard of data manipulation. Therefore, it was mandatory for me to know it. I have also had the occasion of creating more intelligent and autonomous databases with PL/SQL. ",
    "7661893704593052436": " Finally, I have a lot of experience with C++ and QT thanks to the internship I did in Italy at General Medical Merate. I place the OpenCV library in this category as I used it in C++. ",
    "4169477360966665802": "I have some experience",
    "1539426632055473727": " I have developed a certain acquaintance with these languages and libraries during my studies and some small projects. However, I didn’t have the occasion to use them in projects with a bigger scope yet. ",
    "1047957967836750638": "I use a UNIX-based OS every day and rely on WSL when using Windows. Thus, I often have the opportunity to use the command line and most notably the Bash and Zsh shells. I have developed many scripts to facilitate some tasks.",
    "2596904034707720020": "My engineering degree gave much prominence to mathematics and physics, as is customary in France. Therefore, I often used LaTeX to write my reports in those subjects.",
    "7840666555593512701": "I use Markdown every day to take notes on my computer. I find this formatting system simple and intuitive, while being very powerful when paired with the right software like Obsidian.",
    "2199031267872815517": "Drawing UML diagrams is an important step of conception for me. I often use this representation to clarify the model of complex systems.",
    "2904111679978917476": "I have used them",
    "4127585170582842429": " I have written code with these languages before. Though I would be able to remember how to use them rather quickly, I don’t consider them part of my main toolbox.",
    "2861175318593109227": "Technologies and software",
    "8594859322691246637": " I use the three main operating systems regularly. In day-to-day life I use a macOS computer, for gaming a Windows PC, and for my server a Linux distribution. Thus, I am able to quickly and easily switch between OSes, and am comfortable both in a graphical and command line environment. ",
    "922031741543182237": " I used MySQL and PostgreSQL in projects that needed long term storage. Therefore, I can adapt to many different RDBMS technologies. I have also experimented with NoSQL databases, but didn’t use those in a real project yet.",
    "993648591981255942": " Personally, I prefer an all-in-one approach, and therefore use IDEs from JetBrains (IntelliJ, Webstorm, etc) for the great majority of my projects. However, Visual Studio Code has an important place in my workflow when I work on lighter tasks like a Bash script, editing JSON or YML files, and so on. I also know how to use more specialized IDEs depending on the tech stack, like QT Creator for instance. ",
    "3919140703022612923": " I use git on every single project, it’s an invaluable and indispensable tool in my opinion. I also use GitHub to store my code. ",
    "1787542791514250305": "I have been able to use Node.js many times, be it to make backend applications or only to run a JavaScript script.",
    "3464044438652368543": "I have discovered Figma while looking to create designs for my different projects, and now I use it every time I need one. As I’m not a UI/UX designer, I can appreciate the simplicity and versatility of this tool.",
    "2260470174971670215": "I’ve used Microsoft Office for years now; to write reports, complex spreadsheets, or to prepare presentations. I also use equivalent tools from Google Workspace, whose collaborations features I find more polished. ",
    "2311090641268100665": " Looking to experiment with the DevOps workflow, I have learned these technologies to easily containerize and deploy applications. Most notably, this website itself is deployed using Docker and Docker compose.",
    "8903596240255941193": "I have used Electron during the Medchain project. This technology allowed us to transpose our knowledge very easily from the browser to a desktop application.",
    "442538936759650094": "Nginx has been a blessing to easily configure the servers of different projects. Though I’m not a network expert, I still managed to deploy applications without too much trouble.",
    "983117016268135692": "I used Oracle Database during my studies, notably during my database management course in which we designed a complex and automated database using PL/SQL. Though it is a complex software, I understood its use and pertinence in enterprise-scale systems.",
    "3481075551914040653": "During a cloud computing project, we used Firebase and Firestore to discover how to use a FaaS stack.",
    "8910717689845381189": "I used ActiveMQ in an academic project to synchronize multiple applications and allow them to communicate. ",
    "399792011054013135": "DaVinci Resolve is a video editing software. I used it during my studies to make several videos about my projects, but also to conduct interviews for an English course.",
    "6751441754948847748": "Other",
    "8902029436332253262": "Languages",
    "22479728914721775": "French{$LINE_BREAK}{$LINE_BREAK}Native language",
    "8247313663250870270": "English{$LINE_BREAK}{$LINE_BREAK}TOEIC : 990/990{$LINE_BREAK}{$START_LINK}Certificate{$CLOSE_LINK}",
    "824605795902365380": "Spanish{$LINE_BREAK}{$LINE_BREAK}A2",
    "880815556585061475": "Italian{$LINE_BREAK}{$LINE_BREAK}A1",
    "6949278321711573887": "Be it during my studies, hobbies, or because of my travels, I have had the occasion to learn several languages on top of French. English is by far the foreign language I speak best, but I also know some Spanish and Italian.",
    "3014984376950430597": "Certifications",
    "15999953683452512": "Driver's licence"
  }
}
